123456       10 customer-id             pic x(11).
123456       10 customer-name           pic XxxxxxxxxxxxxxxxxxXXXx.
123456       10 customer-salary.
124566          15 fixed-salary         pic 99.
124566          15 variable-salary      pic 99.
124566       10 customer-age            pic 99.